# Ваше завдання — написати функцію add_one, яка приймає список із цифр, які у свою чергу є одним числом.
# До нього необхідно додати 1.
# Тобто. Вам необхідно з набору цифр, що входять до списку, отримати число, скласти його з 1 і отриману суму,
# знову розбити на список із цифр.
# В результаті функція повертає список із цифр, що становлять значення суми.
# Так зі списку з цифрами [1, 2, 3, 4], має вийти число 1234. До нього додаємо 1, і отримуємо 1235.
# Після цього потрібно розбити отримане число на складові цифри. У результаті має бути список [1, 2, 3, 5],
# який повертає функція.

import random
import string

some_num = random.randint(1,5)       # рандомно вибірає кількість запросів (введення цифр)
print(some_num)                 # для інформації - скільки буде запитів цифр

some_list = []                  # список для введених цифр - пустий
my_num_str = ""                 # для створення числа
ii = 0
while ii < some_num:            # цикл створення списку з введених цифр
    # some_list.append(input("Введить цифру : "))     # список для введених цифр
    qq = 0
    while qq == 0:               # цикл перевірки на введення цифри :
        input_num = input("Введить цифру : ")
        if input_num in string.digits and int(len(input_num)) == 1:     # перевірка на цифру та довжина = 1
            some_list.append(input_num)             # список для введених цифр
            qq = 1
        else:
            print("Ви неправильно вказали цифру! Повторить введення цифри! ")
            qq = 0

    my_num_str = my_num_str + some_list[ii]         # одразу створюємо число (str)
    ii += 1
# print(my_num_str)
print(some_list)                    # початковий список з цифр

def add_one(my_num_def):                        # функція приймає число в форматі str (список із цифр)
    # my_num_int = int(my_num_def) + 1    # отримуємо нове число (+1) в int
    # my_num_str2 = str(my_num_int)       # число в str   АБО   заміняємо однією строкою :
    my_num_str2 = str(int(my_num_def) + 1)
    some_list2 = []                             # список для введених цифр - пустий
    for jj in range(len(my_num_str2)):          # цикл створення списку з отриманного числа (+1)
        some_list2.append(my_num_str2[jj])      # створення списку
    print(some_list2)                           # отриманий список з цифр (+1)

add_one(my_num_str)                             # запуск функції
