# Створіть список випадкових чисел із випадковою кількістю елементів від 3 до 10.
# Ваше завдання - створити новий список з 3 елементів початкового списку - першим, третім і другим з кінця.

import random                                   # імпорт бібліотеки 'random'
number_random = random.randint(3, 10)     # випадкова кількість елементів у списку
print(number_random)
my_list0=[]                                     # пустий список - першопочатковий з кількістю елементів 'number_random'
my_list1 = []                                   # пустий список - завдання (з 3-я елементами)

# ************************************************
# 1. СТВОРЕННЯ списку з рандом-кількістю елементів (ДВІ версії):
# v1. Цикл за допомогою 'for'
# for i in range(number_random):
#     my_list0.append(random.randint(0, 100))    # наповнення списку рандом-значень
# #     print(my_list0)

# v2.  Цикл за допомогою 'while'
# i = 0
# while i < number_random:
#     i += 1
#     my_list0.append(random.randint(0, 100))   # наповнення списку рандом-значень
#
# print(my_list0)                               # створений першопочатковий список

# ************************************************
# 2. СТВОРЕННЯ спискук з 3-х елементів згідно завданню (ДВІ версії):
# v1. простим додаванням елементів
# my_list1.append(my_list0[0])
# my_list1.append(my_list0[2])
# my_list1.append(my_list0[-2])

# v2. за допомогою цикла 'for'
# for i in 0, 2, -2:                # для вказаних індексів
#     my_list1.append(my_list0[i])  # наповнення списку
#
# print(my_list1)                   # РЕЗУЛЬТАТ завдання

# ================================================

# ОСТАТОЧНИЙ ВАРІАНТ - так мені подобається :
#
# 1. СТВОРЕННЯ списку з рандом-кількістю елементів (ДВІ версії):
for i in range(number_random):
    my_list0.append(random.randint(0, 100))   # наповнення списку рандом-значень
print(my_list0)     # першопочатковий список
# 2. СТВОРЕННЯ спискук з 3-х елементів згідно завданню (ДВІ версії):
for i in 0, 2, -2:                                  # для вказаних індексів
    my_list1.append(my_list0[i])
print(my_list1)                                     # РЕЗУЛЬТАТ завдання