# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!

# Приклади :
# my_list_0 = [0, 1, 0, 12, 3]              # -> [1, 12, 3, 0, 0]
# my_list_0 = [0]                           # -> [0]
# my_list_0 = [1, 0, 13, 0, 0, 0, 5]        # -> [1, 13, 5, 0, 0, 0, 0]
my_list_0 = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]   # -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]
print(my_list_0)

number_0 = my_list_0.count(0)       # кількість '0' в списку
my_list_1 = my_list_0.copy()        # робимо копію основного списки та працюємо  з копією
my_list_2=[]                        # пустий список для наповнювання `0`

# v1. Видаляємо поступово '0' зі списку my_list_1 та створюємо окремий список з '0'
i = 0
while i < number_0:
    my_list_1.remove(0)
    my_list_2.append(0)
    i += 1
# print(my_list_1)
# print(my_list_2)
my_list = my_list_1 + my_list_2     # об'єднуємо список без '0' зі списком з '0'
print(my_list)
