# Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
# Ну і додатковим завданням є турбота про виведення.
# Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні заповнюватися нулями
# при одноцифрових значеннях.
# Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек.
# Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість
# днів, годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)
# Доповнити провідними нулями можна за допомогою методу zfill(2)
#
#
user_num = int(input("Введить число від 0 до 8640000 : "))
# можна зробити перевірку на введення тільки числа - це у подальшому :)
if 0 <= user_num <= 8640000:
    num_day, num_hour = divmod(user_num, 24 * 60 * 60)          # скільки днів
    num_hour, num_minute = divmod(num_hour, 60 * 60)            # скільки годин
    str_day = ""                                                # str_day - варіанти слова 'день'
    if num_day == 0 or num_day > 4 :                            # визначаємо варіанти слова 'день'
        str_day = "днів"
    elif num_day == 1:
        str_day = "день"
    elif 2 < num_day < 5:
        str_day = "дні"
    num_minute, num_second = divmod(num_minute, 60)             # скільки хвилин та секунд

    # Вивід інформації у форматі : 0 днів 00:00:00
    print(str(num_day) + " " + str_day + ", ", end="")
    print(str(num_hour).zfill(2) + ":" + str(num_minute).zfill(2) + ":" + str(num_second).zfill(2))

else:
    print("Ви ввели неправильне число!")

