# Ваше завдання написати функцію, яка прочитає заданий файл, очистить текст від html-тегів і запише цей текст в інший файл.
#
# html-тег завжди починається з "<" і закінчується на "/>" тобто. потрібно видалити ці символи та все, що між ними.
#
# Функція отримує на вхід два параметри – ім'я файлу, який потрібно очистити, та ім'я файлу,
# куди потрібно записати очищений текст. Ім'я файлу, куди потрібно писати, можна задати за замовчуванням.
#
# Приклади файлів у вкладенні – файл який потрібно очистити (draft.html) та приклад файлу,
# який може вийти на виході з очищеним текстом (cleaned.txt). Файл draft.html необхідно скачати і покласти поряд з файлом,
# де буде вирішення цієї домашки.
#
# Додаткове завдання для тих, хто захоче ускладнити рішення - спробуйте прибрати рядки, в яких немає інформації.
import os.path
### роботf з 'html' файлом (строка починається з "<" і закінчується на "/>") - НЕПРАВИЛЬНО !
# роботf з 'html' файлом (строка починається з ">" і закінчується на "</")

import re

symb1, symb2 = ">", "</"

with open("draft.html", "r", encoding="utf-8") as html_file:
    with open("cleaned.txt", "w", encoding="ANSI") as my_file:
        for line in html_file:                  # цикл по кожному рядку в файлі
            my_text = line.strip()              # видаляєм зайви пробели з обох кінців
            # print(my_text)

            if my_text.find(symb1) and len(my_text) > 1:        # входження символу ">" та наявність рядку
                symb1_ind = my_text.find(symb1)                 # позиція входження
                # print(symb1_ind)

                if my_text.find(symb2, symb1_ind):              # входження символів "</" у тому ж рядку
                    symb2_ind = my_text.find(symb2, symb1_ind)  # позиція входження
                    # print(symb2_ind)
                    find_text = my_text[symb1_ind+1:symb2_ind]+"\n"     # рядок між символами ("\n" - перевод каретки)

                    if len(find_text) > 1 and symb2_ind != -1:          # наявність рядка і входження "</"
                        print(find_text)    # для перевірки
                        # my_file.writelines(find_text)     # так теж можна
                        my_file.write(find_text)            # запис у файл

